In [1]:
import numpy as np
import pandas as pd

In [2]:
l1 = [2,5,8,6,8,9,4,6]
l1[0]

2

In [3]:
d1 = {'a':2,'b':5} #rename index

In [4]:
for i,j in enumerate(l1):
    print(i,j)

0 2
1 5
2 8
3 6
4 8
5 9
6 4
7 6

In [5]:
pd.Series(l1)

0    2
1    5
2    8
3    6
4    8
5    9
6    4
7    6
dtype: int64

In [6]:
dt = {'a':3,'b':4,'c':5}
dt

{'a': 3, 'b': 4, 'c': 5}

In [7]:
t1 = (3,4,5)

In [8]:
#series using tuple
s1 = pd.Series(t1,index=['a','b','c'])
s1

a    3
b    4
c    5
dtype: int64

In [9]:
#using list
lt = [4,'hi','hello',8,45]
s3 = pd.Series(lt,index = ['h','i','j','k','l'])
s3

h        4
i       hi
j    hello
k        8
l       45
dtype: object

In [10]:
t1 = pd.Series([3,4,5],index=['a','b','c'])
t2 = pd.Series([3,5,8],index=['a','b','c'])

In [11]:
t1+t2

a     6
b     9
c    13
dtype: int64

In [12]:
s1 = pd.Series([3,4,5],index=['a','b','c'])
s2 = pd.Series([3,5,8],index=['a','b','d'])
s1+s2

a    6.0
b    9.0
c    NaN
d    NaN
dtype: float64

In [13]:
s1

a    3
b    4
c    5
dtype: int64

In [14]:
#position based indexing
s1[2]

5

In [15]:
#label based indexing
s1['c']

5

In [16]:
s3

h        4
i       hi
j    hello
k        8
l       45
dtype: object

In [17]:
s3[0:3] #last range is excluded in position based indexing

h        4
i       hi
j    hello
dtype: object

In [18]:
s3['h':'k'] #last range is included in label based indexing

h        4
i       hi
j    hello
k        8
dtype: object

In [19]:
s3[['h','j','l']] #random label indexing will required []

h        4
j    hello
l       45
dtype: object

In [20]:
s3

h        4
i       hi
j    hello
k        8
l       45
dtype: object

In [21]:
#new series:
veg = pd.Series({'potato':3,'tomato':6,'chilly':2,"pumpkin":8,"carrot":10,"radish":4})
veg

potato      3
tomato      6
chilly      2
pumpkin     8
carrot     10
radish      4
dtype: int64

In [22]:
veg.values

array([ 3,  6,  2,  8, 10,  4], dtype=int64)

In [23]:
veg.index

Index(['potato', 'tomato', 'chilly', 'pumpkin', 'carrot', 'radish'], dtype='object')

In [24]:
veg.shape

(6,)

In [25]:
veg

potato      3
tomato      6
chilly      2
pumpkin     8
carrot     10
radish      4
dtype: int64

In [26]:
#subset series
veg[0] #using position/index

3

In [27]:
veg['carrot'] #using label

10

In [28]:
veg['pumpkin':'radish']  #range of records last range is included for label

pumpkin     8
carrot     10
radish      4
dtype: int64

In [29]:
veg[1:4] #last range is excluded it will go till 3 index only

tomato     6
chilly     2
pumpkin    8
dtype: int64

In [30]:
veg[['tomato','radish','pumpkin']]

tomato     6
radish     4
pumpkin    8
dtype: int64

In [31]:
veg['tomato':]

tomato      6
chilly      2
pumpkin     8
carrot     10
radish      4
dtype: int64

In [32]:
veg[ :'pumpkin']

potato     3
tomato     6
chilly     2
pumpkin    8
dtype: int64

In [33]:
veg[1:4]

tomato     6
chilly     2
pumpkin    8
dtype: int64

In [34]:
veg[1::3]

tomato     6
carrot    10
dtype: int64

In [35]:
veg

potato      3
tomato      6
chilly      2
pumpkin     8
carrot     10
radish      4
dtype: int64

In [36]:
#iloc/loc
#loc: label based indexing
#iloc : position based indexing

In [37]:
#veg.loc['tomato':'carrot']
veg['tomato':'carrot']

tomato      6
chilly      2
pumpkin     8
carrot     10
dtype: int64

In [38]:
#veg.iloc[0:4]
veg[0:4]

potato     3
tomato     6
chilly     2
pumpkin    8
dtype: int64

In [39]:
veg>2 #boolean output

potato      True
tomato      True
chilly     False
pumpkin     True
carrot      True
radish      True
dtype: bool

In [40]:
veg[veg>2] #filtered output

potato      3
tomato      6
pumpkin     8
carrot     10
radish      4
dtype: int64

In [41]:
veg

potato      3
tomato      6
chilly      2
pumpkin     8
carrot     10
radish      4
dtype: int64

In [42]:
veg.head()  #for top 5 elements

potato      3
tomato      6
chilly      2
pumpkin     8
carrot     10
dtype: int64

In [43]:
veg.head(2) #top 2 elements

potato    3
tomato    6
dtype: int64

In [44]:
veg.tail() #5 from bottom

tomato      6
chilly      2
pumpkin     8
carrot     10
radish      4
dtype: int64

In [45]:
veg.tail(1)

radish    4
dtype: int64

In [46]:
veg[2:5]

chilly      2
pumpkin     8
carrot     10
dtype: int64

In [47]:
#check any values belongs to the series
veg.isin(['onion'])

potato     False
tomato     False
chilly     False
pumpkin    False
carrot     False
radish     False
dtype: bool

In [48]:
veg.isin([2])

potato     False
tomato     False
chilly      True
pumpkin    False
carrot     False
radish     False
dtype: bool

In [49]:
veg[veg.isin([2,4])]

chilly    2
radish    4
dtype: int64

In [50]:
# find unique values and their frequecies

In [51]:
list('abcd')

['a', 'b', 'c', 'd']

In [52]:
new = pd.Series(list('abcd'*4))
new

0     a
1     b
2     c
3     d
4     a
5     b
6     c
7     d
8     a
9     b
10    c
11    d
12    a
13    b
14    c
15    d
dtype: object

In [53]:
#unique() : name of all unique records
#nunique(): count of unique records
#value_counts(): name of uniques records with their occurences

In [54]:
new.unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [55]:
new.nunique()

4

In [56]:
new.value_counts()

a    4
b    4
c    4
d    4
dtype: int64

In [57]:
#dealing with duplicates
new[new.duplicated()]

4     a
5     b
6     c
7     d
8     a
9     b
10    c
11    d
12    a
13    b
14    c
15    d
dtype: object

In [58]:
new.drop_duplicates()

0    a
1    b
2    c
3    d
dtype: object

In [59]:
#sorting the data
#sort_values, sort_index

In [60]:
veg.sort_values()

chilly      2
potato      3
radish      4
tomato      6
pumpkin     8
carrot     10
dtype: int64

In [61]:
veg.sort_index()

carrot     10
chilly      2
potato      3
pumpkin     8
radish      4
tomato      6
dtype: int64

In [62]:
new.sort_values()

0     a
4     a
8     a
12    a
1     b
5     b
9     b
13    b
2     c
6     c
10    c
14    c
3     d
7     d
11    d
15    d
dtype: object

In [63]:
new.sort_index()

0     a
1     b
2     c
3     d
4     a
5     b
6     c
7     d
8     a
9     b
10    c
11    d
12    a
13    b
14    c
15    d
dtype: object

In [64]:
#dealing with missing data
x = pd.Series([2,4,5,3,np.nan,3,np.nan])
x

0    2.0
1    4.0
2    5.0
3    3.0
4    NaN
5    3.0
6    NaN
dtype: float64

In [68]:
x.isnull()

0    False
1    False
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [69]:
x.isnull().sum()

2

In [71]:
x.fillna(2.5)

0    2.0
1    4.0
2    5.0
3    3.0
4    2.5
5    3.0
6    2.5
dtype: float64

In [72]:
x.fillna(x.mean())

0    2.0
1    4.0
2    5.0
3    3.0
4    3.4
5    3.0
6    3.4
dtype: float64

In [73]:
#ffill() bfill()
x

0    2.0
1    4.0
2    5.0
3    3.0
4    NaN
5    3.0
6    NaN
dtype: float64

In [74]:
x.ffill()

0    2.0
1    4.0
2    5.0
3    3.0
4    3.0
5    3.0
6    3.0
dtype: float64

In [75]:
x.bfill()

0    2.0
1    4.0
2    5.0
3    3.0
4    3.0
5    3.0
6    NaN
dtype: float64

In [76]:
x.dropna()

0    2.0
1    4.0
2    5.0
3    3.0
5    3.0
dtype: float64

In [77]:
check = pd.Series(['alex','mathhew','john','romain'])
check

0       alex
1    mathhew
2       john
3     romain
dtype: object

In [78]:
check.map(lambda x:len(x))

0    4
1    7
2    4
3    6
dtype: int64

In [79]:
#Series: one dim
#Dataframe: 2 dim,tabular/sql table/csv or excel etc

In [80]:
dt = pd.DataFrame()
dt

Empty DataFrame
Columns: []
Index: []

In [82]:
dt1 = [5,3,7,6,5,4]
dt2 = pd.DataFrame(dt1)
dt2

   0
0  5
1  3
2  7
3  6
4  5
5  4

In [83]:
data = [['alex',30],['matthew',45],['romain',56]]
dt3 = pd.DataFrame(data,columns=['name','age'])
dt3

      name  age
0     alex   30
1  matthew   45
2   romain   56

In [95]:
data = {'name':['tom','alan','jack','rosy','jess','lily','mak'],'age':[34,76,34,67,12,45,76]}
dt4 = pd.DataFrame(data,index=['rank1','rank2','rank3','rank4','rank5','rank6','rank7'])
dt4

       name  age
rank1   tom   34
rank2  alan   76
rank3  jack   34
rank4  rosy   67
rank5  jess   12
rank6  lily   45
rank7   mak   76

In [96]:
#dataframes attributes
dt4.index

Index(['rank1', 'rank2', 'rank3', 'rank4', 'rank5', 'rank6', 'rank7'], dtype='object')

In [97]:
dt4.columns

Index(['name', 'age'], dtype='object')

In [98]:
dt4.dtypes

name    object
age      int64
dtype: object

In [99]:
dt4.shape

(7, 2)

In [101]:
dt4.head()

       name  age
rank1   tom   34
rank2  alan   76
rank3  jack   34
rank4  rosy   67
rank5  jess   12

In [102]:
dt4.head(3)

       name  age
rank1   tom   34
rank2  alan   76
rank3  jack   34

In [103]:
dt4.tail()

       name  age
rank3  jack   34
rank4  rosy   67
rank5  jess   12
rank6  lily   45
rank7   mak   76

In [104]:
dt4.tail(2)

       name  age
rank6  lily   45
rank7   mak   76

In [105]:
dt4[2:5] #last range will be excluded last-1 (5-1=4)

       name  age
rank3  jack   34
rank4  rosy   67
rank5  jess   12

In [106]:
dt4['name'] #extract column from df

rank1     tom
rank2    alan
rank3    jack
rank4    rosy
rank5    jess
rank6    lily
rank7     mak
Name: name, dtype: object

In [107]:
#another way
dt4.name

rank1     tom
rank2    alan
rank3    jack
rank4    rosy
rank5    jess
rank6    lily
rank7     mak
Name: name, dtype: object

In [108]:
df = pd.DataFrame(np.random.randint(0,50,20).reshape(5,4),index=list('abcde'),columns=list('pqrs'))
df

    p   q   r   s
a  30  29  32  44
b  47  21  40  47
c   6  31  45  27
d  17  35  27  30
e  49   6  11  11

In [111]:
df.p
#df['p'] #another way to extract particular column

a    30
b    47
c     6
d    17
e    49
Name: p, dtype: int32

In [112]:
df['p':'r']

Empty DataFrame
Columns: [p, q, r, s]
Index: []

In [113]:
#loc: label based index
#iloc position based index

In [114]:
df.loc['a':'d','p':'r']    #df.loc[row,col]

    p   q   r
a  30  29  32
b  47  21  40
c   6  31  45
d  17  35  27

In [116]:
df.iloc[0:4,0:3]

    p   q   r
a  30  29  32
b  47  21  40
c   6  31  45
d  17  35  27